node_modules/wemonode/commands/socket_switch_setbinarystate.json

{
    "appliesTo": ["socket", "lightswitch"],
    "soapAction": "\"urn:Belkin:service:basicevent:1#SetBinaryState\"",
    "path": "/upnp/control/basicevent1",
    "envelope":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:SetBinaryState xmlns:u=\"urn:Belkin:service:basicevent:1\"><BinaryState>$$BINARYSTATE$$</BinaryState></u:SetBinaryState></s:Body></s:Envelope>",
    "parameters": ["binarystate"]
}
